import telebot,time,random
from telebot import types
bot=telebot.AsyncTeleBot('1134411115:AAGzSm12JwKnXvzi1IvecuN1y30dEtOJHnI')
correct_answers1=['A','A','D','C','C','A','C','C','B','A','C','C','A','B','B','A']
Q1='1. Відношення R на множині А є відношення порядку, якщо воно ...\n----------------------------------------------------------------------------------------------------- \nA) рефлексивне, антисиметричне і транзитивне\
 \nB) рефлексивне, антисиметричне \nC) антирефлексивне, \nD) антисиметричне, антитранзитивне'
Q2='1. Множина A у  випадку рефлексивності, антисиметричності і транзитивності відношення R називається ...\n----------------------------------------------------------------------------------------------------- \nА) \
частково впорядкованою множиною або ЧУ-множиною з порядком R \nВ) частково впорядкованою множиною \nC)скінченною множиною\
 \nD) нескінченною частково впорядкованою множиною  '
Q3='2. Два елементи а і b частково впорядкованої множини (ЧУ-множини) (S, ≤) порівнянні, якщо ...\n----------------------------------------------------------------------------------------------------- \nА) а ≤ b або b ≤ а\
  \nB) b ≤ b \nC) a ≤ а \nD) b>=a '
Q4='2. Якщо кожні два елементи частково впорядкованої множини (S, ≤) порівнянні, тоді (S, ≤) називається...\n----------------------------------------------------------------------------------------------------- \nA) \
 тотально або лінійно впорядкованою множиною або ланцюгом \nB) множиною, що складається з тих і тільки тих елементів \
які належать множині А і не належать В \nC) тотальним,  або лінійним порядком  \
   \nD) Нелінійним порядком впорядкованої величини'
Q5='3. Якщо b ≤ а (або а ≥ b) для всіх b з В  для підмножини B ЧУ-множині A елемент а з A називають...\n----------------------------------------------------------------------------------------------------- \nA) \
найменшою верхньою гранню, \nB) множиною, що складається з тих і тільки тих елементів, які належать множині А і не належать \
B, \nC) найбільшою верхньою гранню \nD) верхньою гранню'
Q6='3. Найменша верхня грань для всієї ЧУ-множини A (якщо вона існує) називається...\n----------------------------------------------------------------------------------------------------- \nA) найбільшою верхньою гранню, \nB) \
нижньою гранню, \nC) найменшим елементом, \nD) найбільшим елементом'
Q7 = "4. Елемент а підмножини B ЧУ-множини A називається максимальним елементом B, якщо...\n----------------------------------------------------------------------------------------------------- \nA) \
для кожного елементу b є B з того, що b ≤ а, випливає b = а \nB) для кожного елементу b є B з того, що b ≤ а, випливає b < а\
\nC) для кожного елемента b є B з того, що b ≥ а, випливає b = а\
\nD) для кожного елементу b є B з того, що b ≤ а, випливає b > а"
Q8 = "4. ЧУ-множина А, всі двоелементні підмножини якої мають найбільшу нижню грань, що належить А, і позначається  (А, ·) називається\
 ...\n-----------------------------------------------------------------------------------------------------\nA) верхньою гранню \nB) верхньою напіврешіткою \nC)нижньою напіврешіткою  \nD) нижнью гранню"
Q9 = '5. Нехай А - верхня напіврешітка. Тоді для всіх\nа, b, c Є А \n----------------------------------------------------------------------------------------------------- \nA) a ∧ (b ∧ c) = (а ∧ b) ∧ с, а ∧ а = а і а ∧b =\
 b ∧ а \nB) a ∧ (b ∨ c) = (а ∨ b) ∧ с, а ∨ а = а і а ∧ b = b ∨ а\nC) a ∨ (b ∨ c) = (а ∨ b) ∨ с, а ∨ а = а і а ∨ b = b ∨ a\nD) a ∧ (b ∧ c) = (а ∧ b) ∧ с, а ∨ а = а і а ∧ b = b ∨ а'
Q10 = "5. Нехай (S, ×) і (T, ◦) - напівгрупи і f : S → T - така функція, що f(s · s') = f(s) ◦ f(s').\n----------------------------------------------------------------------------------------------------- \nA) \
- Функція f називається голоморфізмом з S в Т\
\nB) Функція f називається ізоморфізмом з S в Т \nC) Функція f називається гомоморфізмом з S в Т\nD) Функція f називається поліморфізмом з S в Т"
Q11 = "6. Якщо в (S, *) існує елемент І такий, що I * а = а * I = а для всіх а з А, то таке І називається ...\n----------------------------------------------------------------------------------------------------- \nA) одиницею напівгрупи (S, *)\
      \nB) напівгрупою з одиницею, або моноїдом \nC) абелевою, або комутативною напівгрупою"
Q12 = "6. Якщо (S, *) - напівгрупа, і S' Í S, то S' називається піднапівгрупою напівгрупи S, якщо *...\n----------------------------------------------------------------------------------------------------- \nA) бінарна операція на S'\
      \nB) унарна операція на S'\nC) тернарна операція на S'"
Q13 = "7. Елемент а напівгрупи називається ідемпотентом, якщо\n----------------------------------------------------------------------------------------------------- \nA) а * а !=а \nB) А  ⋂ А= Ā \nC) а * а = а"
Q14 = "7. Обмежена дистрибутивна решітка (S, +, ·), в якій є унарна операція ' на множині S така, що x + x' = 1 і x · x' = 0 називається\n-----------------------------------------------------------------------------------------------------\
\nA) Булевою алгеброю \nB) доповненням x \nC) ЧУ множиною"
Q15 = "8. Решіткою називається\n----------------------------------------------------------------------------------------------------- \nA) з'єднання а і b \nB) переріз а і b \nC) ЧУ-множина (S, ≤), яка є і нижньою, і верхньою напіврешіткою"
Q16 = "8. Якщо  множина S, як ЧУ-множина, має найменшу верхню грань і найбільшу нижню грань\n----------------------------------------------------------------------------------------------------- \nто решітки (S, ∨ , ∧) називаються дистрибутивною\
      \nB) то решітки (S, ∨ , ∧) називаються необмеженими \nC)A) то решітки (S, ∨ , ∧) називаються обмеженими "
Q17 = "9. Нехай (S, ×) і (T, ◦) - напівгрупи і f : S → T - гомоморфізм з S в Т. Визначимо відношення R на множині S таким чином: sRs', якщо f(s) = f(s').\n----------------------------------------------------------------------------------------------------- \nA) Ізоморфізм\nB) Тоді відношення R - відношення конгруентності.\
\nC) Гомоморфізм"
Q18 = "9. Підгрупа А* називається група ...\n----------------------------------------------------------------------------------------------------- \nA) Група з одиницею \nB) що породжена  множиною А \nC) циклічна група"
Q19 = "10. Розглянемо множину S = {i, -i, -1, 1} з операцією множення\n----------------------------------------------------------------------------------------------------- \nA) Це циклічна група \nB) це верхня напіврешітка \nC) це нижня напіврешітка"
Q20 = "10. А називається мінімальною породжуючою множиною для групи G, якщо ..\n----------------------------------------------------------------------------------------------------- \nA) множина А породжує групу G і жодна власна підмножина множини А не породжує G \
 \nB) множина А не породжує групу G і хоча б одна власна підмножина множини А породжує G\
\nC)множина А породжує групу G і хоча б одна власна підмножина множини А породжує G"
Q21 = "11. Якщо для кожної власної підмножини B множини А маємо В* ≠ А*, тоді А називається\n-----------------------------------------------------------------------------------------------------\
 \nA) Породженою множиною\nB) Група з одиницею\n C) Породжуючою множиною для А* "
Q22 = "11. А називається мінімальною породжуючою множиною для групи G, якщо ... \n-----------------------------------------------------------------------------------------------------\
 \nA) множина А породжує групу G і хоча б одна власна підмножина множини А породжує G\nB)множина А не породжує групу G і хоча б одна власна підмножина множини А породжує G \nС) множина А породжує групу G і жодна власна підмножина множини А не породжує G "
Q23 = "12. B циклічній групі породжуюча множина ...\n----------------------------------------------------------------------------------------------------- \nA) може бути утворена двома елементом \nB) може бути утворена багатьма елементом\n C) може бути утворена одним елементом"
Q24 = "12. Для підгрупи H групи G і довільного а з G  а ◦ H = {x : x = а ◦ h для деякого h з H} називається\n-----------------------------------------------------------------------------------------------------\
      \nA) лівим суміжним класом підгрупи H групи G.\nB) правим суміжним класом підгрупи H групи G.\nC) середнім суміжним класом підгрупи H групи G."
Q25 = "13. Чи вірно, що для фіксованої підгрупи H групи G ліві суміжні класи підгрупи H групи G утворюють розбиття групи G?\n-----------------------------------------------------------------------------------------------------\
      \nA) так \nB) ні \nC) частково"
Q26 = "13. Теорема Лагранжа. Якщо G - скінченна група і H - підгрупа групи G, то порядок H\n-----------------------------------------------------------------------------------------------------\
     \nA) помножує порядок  G.\nB) ділить порядок G. \nC) віднімає порядок G."
Q27 = "14. Образи підгруп з області визначення є підгрупами в \n-----------------------------------------------------------------------------------------------------\
 \nA) області визначення \nB) області значень \nC) жодний з варіантів не є вірним"
Q28 = "14. Нехай (G, •) і (H, *) - групи, де • і * - операції на G і H відповідно. Нехай f : G→H - функція.\n-----------------------------------------------------------------------------------------------------\
 \nA) Функція f називається мономорфізмом\nB) Функція f називається гомоморфізмо\nC) Функція f називається епіморфізмом"
Q29 = "15. Гомоморфізм f називається мономорфізмом, якщо ...\n-----------------------------------------------------------------------------------------------------\
 \nA) функція f - бієкція \nB) функція f - ін'єкція\nC) функція f – сюр’єкція "
Q30 = "15. Якщо Н - нормальна підгрупа групи (G, ◦), то суміжні класи підгрупи Н в групі G породжують групу відносно операції (аН)(bН) = аbН.\n-----------------------------------------------------------------------------------------------------\
 \nA) Ця група називається циклічною групою \nB) Ця група називається фактор-групою B\nC) Ця група називається комутативною групою"
questions1=[Q1,Q3,Q5,Q7,Q9,Q11,Q13,Q15,Q17,Q19,Q21,Q23,Q25,Q27,Q29,'Тест завершен. ']
questions2=[Q2,Q4,Q6,Q8,Q10,Q12,Q14,Q16,Q18,Q20,Q22,Q24,Q26,Q28,Q30,'Тест завершен. ']
markup_main = types.ReplyKeyboardMarkup(row_width=2)
btn1 = types.InlineKeyboardButton('Вариант 1')
btn2 = types.InlineKeyboardButton('Вариант 2')
markup_main.add(btn1, btn2)
markup_tests4 = types.ReplyKeyboardMarkup(row_width=2)
markup_tests3 = types.ReplyKeyboardMarkup(row_width=3)
markup_strt = types.ReplyKeyboardMarkup(row_width=1)
btn1_tst = types.InlineKeyboardButton('A')
btn2_tst = types.InlineKeyboardButton('B')
btn3_tst = types.InlineKeyboardButton('C')
btn4_tst = types.InlineKeyboardButton('D')
btn_strt= types.InlineKeyboardButton('/start')
markup_tests4.add(btn1_tst,btn2_tst,btn3_tst,btn4_tst)
markup_tests3.add(btn1_tst,btn2_tst,btn3_tst)
markup_strt.add(btn_strt)
start_time = time.time()
yes=1

@bot.message_handler(commands=['start'])
def start_message(message):
    global userw
    bot.send_message(message.chat.id, 'Выберите тест',reply_markup=markup_main)
    userw = open('D:/disc/' + str(message.chat.first_name) + str(message.chat.last_name) + str(message.chat.id)+'.txt', 'w')
    with userw:
        userw.write('0'+'\n')
        userw.write('0')
@bot.message_handler(commands=['rashit'])
def rashit(message) :
    for i in questions1:
         bot.send_message(bot.send_message(544690993,'hui'))
@bot.message_handler(content_types=['text'])
def send_text(message):
   try:
    global start_time
    userr = open('D:/disc/'+ str(message.chat.first_name)+ str(message.chat.last_name) +str(message.chat.id)+'.txt','r+')
    if yes == 1:
        with userr:
            i=int(userr.readline())
            grade=int(userr.readline())
    if message.text == 'send data' and message.chat.id == 393206440:
        bot.send_message(393206440,dataread.read())
    if message.text == 'Вариант 1':
        bot.send_message(message.chat.id, questions1[i], reply_markup=markup_tests4)
    if message.text == 'Вариант 2':
        bot.send_message(message.chat.id, questions2[i], reply_markup=markup_tests4)
    if message.text == correct_answers1[i]:

        grade=grade+1
    if i<15 and (message.text == 'A' or message.text == 'B' or message.text == 'C' or message.text == 'D'):
        bot.send_message(message.chat.id, questions1[i + 1], reply_markup=markup_tests4)
        i = i + 1
        print(time.time() - start_time)
        if (time.time() - start_time) > 1000:
            bot.send_message(message.chat.id,'Время закончилось.')
            bot.send_message(message.chat.id, 'Ваша оценка: ' + str(grade),
                             )
            bot.send_message(393206440, str(message.chat.first_name) + ' ' + str(message.chat.last_name) + str(grade))
            quit(1)
        userr = open('D:/disc/'+ str(message.chat.first_name) + str(message.chat.last_name) + str(message.chat.id) + '.txt', 'r+')
        with userr:
            userr.write(str(i)+'\n')
            userr.write(str(grade)+'\n')
    if i == 15:
        userr = open(
            'D:/disc/' + str(message.chat.first_name) + str(message.chat.last_name) + str(message.chat.id) + '.txt',
            'r+')
        if yes == 1:
            with userr:
                i = int(userr.readline())
                grade = int(userr.readline())
        bot.send_message(message.chat.id,'Ваша оценка: '+str(grade),reply_markup=markup_main)
        bot.send_message(393206440, message.chat.id)
        bot.send_message(393206440, str(message.chat.first_name) + ' ' + str(message.chat.last_name) + str(grade))
        #bot.send_message(420851241, 'Артур иди нахуй')
        #bot.send_message(285884276, str(name) + str(grade), reply_markup=markup_strt)
   except FileNotFoundError:
       bot.send_message(message.chat.id,'Произошла ошибка,перезапустите бота,нажав на кнопку',reply_markup=markup_strt)

bot.polling()